2024.04.09.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2024.04.02.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2024.04.16.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of April 02 to 09, 2024.

#+TOC: headlines 1


* moonpool 0.6
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-moonpool-0-6/14424/1

** Simon Cruanes announced


Dearest friends of the dual hump,

I'm happy to announce the release of [[https://github.com/c-cube/moonpool/releases/tag/v0.6][moonpool 0.6]]. Moonpool is a library of
schedulers and concurrency primitives for OCaml 4.xx and 5.xx, based on threads (possibly spread on multiple domains). Previous
release announcements ([[https://discuss.ocaml.org/t/ann-release-of-moonpool-0-5/13387][0.5]],
[[https://discuss.ocaml.org/t/ann-moonpool-0-4/12941][0.4]], [[https://discuss.ocaml.org/t/ann-moonpool-0-3/12632][0.3]],
[[https://discuss.ocaml.org/t/ann-moonpool-0-2/12447][0.2]], [[https://discuss.ocaml.org/t/ann-moonpool-0-1/12387][0.1]]) contain more
details.

This release is fairly large and contains some new libraries. The biggest improvement is the addition of ~moonpool.fib~ (OCaml 5
only): it defines lightweight _fibers_ with structured concurrency, where the fibers can run on a thread pool chosen by the user.
Fibers also come with fiber-local storage and a notion of cancellation that is propagated to children fibers. Overall, fibers are a
nicer abstraction than bare futures (especially with monadic combinators). There are currently no cooperative IO primitives provided
by the scheduler but I have plans.

Another new, more experimental library is ~moonpool-lwt~ (OCaml 5 only) which allows for interoperability between Lwt and moonpool: a
moonpool future (or fiber) can be turned into a Lwt promise; and it becomes possible to ~await~ a Lwt promise from moonpool, in a
thread-safe way.

Docs:
- [[https://c-cube.github.io/moonpool/moonpool/index.html][moonpool]]
- [[https://c-cube.github.io/moonpool/moonpool-lwt/index.html][moonpool-lwt]]
      



* sqids 0.1.0
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ann-sqids-0-1-0/14425/1

** Leo Soares announced


I'm happy to announce the first release (0.1.0) of the [[https://sqids.org/ocaml][official OCaml port of Sqids]].

#+begin_quote
Sqids (pronounced "squids") is an open-source library that lets you generate short unique identifiers from numbers. These IDs are
URL-safe, can encode several numbers, and do not contain common profanity words.
#+end_quote

https://opam.ocaml.org/packages/sqids
      



* OCaml Retreat at Auroville, India (March 10th - March 15th)
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/ocaml-retreat-at-auroville-india-march-10th-march-15th/14006/4

** Sudha Parimala announced


I'm happy to share the experience report from the first OCaml Retreat: https://ocamlretreat.org/2024/03/24/retreat-experience.html.
Thanks to all the participants for contributing to the magic of the event. We hope to run more such retreats in the future!
      



* Miou, a simple scheduler for OCaml 5
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-miou-a-simple-scheduler-for-ocaml-5/12963/14

