2024.04.09.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-09 Tue 11:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2024.04.02.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2024.04.16.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of April 02 to 09, 2024.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">moonpool 0.6</a></li>
<li><a href="#2">sqids 0.1.0</a></li>
<li><a href="#3">OCaml Retreat at Auroville, India (March 10th - March 15th)</a></li>
<li><a href="#4">Miou, a simple scheduler for OCaml 5</a></li>
<li><a href="#5">OCaml.org Newsletter: March 2024</a></li>
<li><a href="#6">Opam 102: Pinning Packages, by OCamlPro</a></li>
<li><a href="#7">dune 3.15</a></li>
<li><a href="#8">Ocsigen: summary of recent releases</a></li>
<li><a href="#9">Js_of_ocaml 5.7</a></li>
<li><a href="#10">Eio Developer Meetings</a></li>
<li><a href="#11">Ocaml developer at Routine, Paris</a></li>
<li><a href="#12">dream-html 3.0.0</a></li>
<li><a href="#13">Other OCaml News</a></li>
<li><a href="#org427b2f2">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">moonpool 0.6</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-moonpool-0-6/14424/1">https://discuss.ocaml.org/t/ann-moonpool-0-6/14424/1</a>
</p>
</div>
<div id="outline-container-org279d88e" class="outline-3">
<h3 id="org279d88e">Simon Cruanes announced</h3>
<div class="outline-text-3" id="text-org279d88e">
<p>
Dearest friends of the dual hump,
</p>

<p>
I'm happy to announce the release of <a href="https://github.com/c-cube/moonpool/releases/tag/v0.6">moonpool 0.6</a>. Moonpool is a library of
schedulers and concurrency primitives for OCaml 4.xx and 5.xx, based on threads (possibly spread on multiple domains). Previous
release announcements (<a href="https://discuss.ocaml.org/t/ann-release-of-moonpool-0-5/13387">0.5</a>,
<a href="https://discuss.ocaml.org/t/ann-moonpool-0-4/12941">0.4</a>, <a href="https://discuss.ocaml.org/t/ann-moonpool-0-3/12632">0.3</a>,
<a href="https://discuss.ocaml.org/t/ann-moonpool-0-2/12447">0.2</a>, <a href="https://discuss.ocaml.org/t/ann-moonpool-0-1/12387">0.1</a>) contain more
details.
</p>

<p>
This release is fairly large and contains some new libraries. The biggest improvement is the addition of <code>moonpool.fib</code> (OCaml 5
only): it defines lightweight <span class="underline">fibers</span> with structured concurrency, where the fibers can run on a thread pool chosen by the user.
Fibers also come with fiber-local storage and a notion of cancellation that is propagated to children fibers. Overall, fibers are a
nicer abstraction than bare futures (especially with monadic combinators). There are currently no cooperative IO primitives provided
by the scheduler but I have plans.
</p>

<p>
Another new, more experimental library is <code>moonpool-lwt</code> (OCaml 5 only) which allows for interoperability between Lwt and moonpool: a
moonpool future (or fiber) can be turned into a Lwt promise; and it becomes possible to <code>await</code> a Lwt promise from moonpool, in a
thread-safe way.
</p>

<p>
Docs:
</p>
<ul class="org-ul">
<li><a href="https://c-cube.github.io/moonpool/moonpool/index.html">moonpool</a></li>
<li><a href="https://c-cube.github.io/moonpool/moonpool-lwt/index.html">moonpool-lwt</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">sqids 0.1.0</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-sqids-0-1-0/14425/1">https://discuss.ocaml.org/t/ann-sqids-0-1-0/14425/1</a>
</p>
</div>
<div id="outline-container-org8738738" class="outline-3">
<h3 id="org8738738">Leo Soares announced</h3>
<div class="outline-text-3" id="text-org8738738">
<p>
I'm happy to announce the first release (0.1.0) of the <a href="https://sqids.org/ocaml">official OCaml port of Sqids</a>.
</p>

<blockquote>
<p>
Sqids (pronounced "squids") is an open-source library that lets you generate short unique identifiers from numbers. These IDs are
URL-safe, can encode several numbers, and do not contain common profanity words.
</p>
</blockquote>

<p>
<a href="https://opam.ocaml.org/packages/sqids">https://opam.ocaml.org/packages/sqids</a>
</p>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">OCaml Retreat at Auroville, India (March 10th - March 15th)</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-retreat-at-auroville-india-march-10th-march-15th/14006/4">https://discuss.ocaml.org/t/ocaml-retreat-at-auroville-india-march-10th-march-15th/14006/4</a>
</p>
</div>
<div id="outline-container-org09b8dd6" class="outline-3">
<h3 id="org09b8dd6">Sudha Parimala announced</h3>
<div class="outline-text-3" id="text-org09b8dd6">
<p>
I'm happy to share the experience report from the first OCaml Retreat: <a href="https://ocamlretreat.org/2024/03/24/retreat-experience.html">https://ocamlretreat.org/2024/03/24/retreat-experience.html</a>.
Thanks to all the participants for contributing to the magic of the event. We hope to run more such retreats in the future!
</p>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">Miou, a simple scheduler for OCaml 5</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-miou-a-simple-scheduler-for-ocaml-5/12963/14">https://discuss.ocaml.org/t/ann-miou-a-simple-scheduler-for-ocaml-5/12963/14</a>
</p>
</div>
