2024.04.09.txt
                          ━━━━━━━━━━━━━━━━━━━
                           OCAML WEEKLY NEWS
                          ━━━━━━━━━━━━━━━━━━━


[Previous Week] [Up] [Next Week]

Hello

Here is the latest OCaml Weekly News, for the week of April 02 to 09,
2024.

Table of Contents
─────────────────

moonpool 0.6
sqids 0.1.0
OCaml Retreat at Auroville, India (March 10th - March 15th)
Miou, a simple scheduler for OCaml 5
OCaml.org Newsletter: March 2024
Opam 102: Pinning Packages, by OCamlPro
dune 3.15
Ocsigen: summary of recent releases
Js_of_ocaml 5.7
Eio Developer Meetings
Ocaml developer at Routine, Paris
dream-html 3.0.0
Other OCaml News
Old CWN


[Previous Week] <https://alan.petitepomme.net/cwn/2024.04.02.html>

[Up] <https://alan.petitepomme.net/cwn/index.html>

[Next Week] <https://alan.petitepomme.net/cwn/2024.04.16.html>


moonpool 0.6
════════════

  Archive: <https://discuss.ocaml.org/t/ann-moonpool-0-6/14424/1>


Simon Cruanes announced
───────────────────────

  Dearest friends of the dual hump,

  I'm happy to announce the release of [moonpool 0.6]. Moonpool is a
  library of schedulers and concurrency primitives for OCaml 4.xx and
  5.xx, based on threads (possibly spread on multiple domains). Previous
  release announcements ([0.5], [0.4], [0.3], [0.2], [0.1]) contain more
  details.

  This release is fairly large and contains some new libraries. The
  biggest improvement is the addition of `moonpool.fib' (OCaml 5 only):
  it defines lightweight _fibers_ with structured concurrency, where the
  fibers can run on a thread pool chosen by the user.  Fibers also come
  with fiber-local storage and a notion of cancellation that is
  propagated to children fibers. Overall, fibers are a nicer abstraction
  than bare futures (especially with monadic combinators). There are
  currently no cooperative IO primitives provided by the scheduler but I
  have plans.

  Another new, more experimental library is `moonpool-lwt' (OCaml 5
  only) which allows for interoperability between Lwt and moonpool: a
  moonpool future (or fiber) can be turned into a Lwt promise; and it
  becomes possible to `await' a Lwt promise from moonpool, in a
  thread-safe way.

  Docs:
  • [moonpool]
  • [moonpool-lwt]


[moonpool 0.6] <https://github.com/c-cube/moonpool/releases/tag/v0.6>

[0.5] <https://discuss.ocaml.org/t/ann-release-of-moonpool-0-5/13387>

[0.4] <https://discuss.ocaml.org/t/ann-moonpool-0-4/12941>

[0.3] <https://discuss.ocaml.org/t/ann-moonpool-0-3/12632>

[0.2] <https://discuss.ocaml.org/t/ann-moonpool-0-2/12447>

[0.1] <https://discuss.ocaml.org/t/ann-moonpool-0-1/12387>

[moonpool] <https://c-cube.github.io/moonpool/moonpool/index.html>

[moonpool-lwt]
<https://c-cube.github.io/moonpool/moonpool-lwt/index.html>


sqids 0.1.0
═══════════

  Archive: <https://discuss.ocaml.org/t/ann-sqids-0-1-0/14425/1>


Leo Soares announced
────────────────────

  I'm happy to announce the first release (0.1.0) of the [official OCaml
  port of Sqids].

        Sqids (pronounced "squids") is an open-source library that
        lets you generate short unique identifiers from
        numbers. These IDs are URL-safe, can encode several
        numbers, and do not contain common profanity words.

  <https://opam.ocaml.org/packages/sqids>


[official OCaml port of Sqids] <https://sqids.org/ocaml>


OCaml Retreat at Auroville, India (March 10th - March 15th)
═══════════════════════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ocaml-retreat-at-auroville-india-march-10th-march-15th/14006/4>


Sudha Parimala announced
────────────────────────

  I'm happy to share the experience report from the first OCaml Retreat:
  <https://ocamlretreat.org/2024/03/24/retreat-experience.html>.  Thanks
  to all the participants for contributing to the magic of the event. We
  hope to run more such retreats in the future!


Miou, a simple scheduler for OCaml 5
════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ann-miou-a-simple-scheduler-for-ocaml-5/12963/14>
