2024.04.09.html
<div id="outline-container-orgce1de37" class="outline-3">
<h3 id="orgce1de37">Calascibetta Romain announced</h3>
<div class="outline-text-3" id="text-orgce1de37">
<p>
I am delighted to announce the release of <code>miou.0.1.0</code>. This release is undoubtedly the culmination and synthesis of the work of
several individuals to offer a library that best fits our needs. We're quite convinced by the API we're proposing and quite happy
with the implementation. As such, we're coming out of beta to offer version 0.1.0. Above all, this means that the API will change
very little, and the library is now ready for use. However, we are not yet in 1.0.0 because we would like to give you time to use
Miou, to observe possible bugs, and to give us time to correct these possible bugs in order to prepare version 1.0.0 with peace of
mind. You can install the package via OPAM (it will be available soon):
</p>
<div class="org-src-container">
<pre class="src src-shell">$ opam install miou
</pre>
</div>

<p>
We would sincerely like to thank all individuals who have contributed, whether directly or indirectly, to the project.
</p>

<p>
Furthermore, this new version of Miou builds upon the excellent work of @polytypic and his <a href="https://github.com/ocaml-multicore/picos">picos</a> project. We have
incorporated certain elements that are suitable for implementing a scheduler, and we hope that our efforts will lead to a certain
standardization of the effects used by different schedulers in OCaml.
</p>

<p>
This rewrite has been carried out while trying to maintain the same semantics and API as what we offered in version <code>0.0.1~beta2</code>
(however, it is the nature of a beta to potentially break versions). This rewrite culminated in the reimplementation of an <a href="https://github.com/robur-coop/httpcats">HTTP
client and server</a> (supporting http/1.1
or h2 with TLS which can handle <a href="https://twitter.com/Dinoosaure/status/1775586989749788745">200k req/sec</a>) as well as our good old <a href="https://github.com/robur-coop/miou/tree/main/happy">happy-eyeballs</a> example. Moreover, the outcome
of these implementations is more satisfying to us than their previous versions. At least for now, considering the various changes our
cooperative has embarked on¹, we will not yet release them.
</p>

<p>
We also took the time to integrate a version of the priority queue verified using <a href="https://www.why3.org/">Why3</a>. We would like to thank @Armael and
@backtracking (as well as the individuals who contributed to and maintained the <a href="https://github.com/ocaml-gospel/vocal">Vocal</a> project) for their assistance.
</p>

<p>
Finally, I would like to personally thank the <a href="https://robur.coop/">Robur</a> cooperative for providing me with the necessary time to evolve this
project.
</p>

<p>
This release further confirms what we aim to offer to users, and in this regard, we have taken the time to write a small book
explaining the use of Miou. This can also be seen as an introduction to asynchronous programming and effects. It is available
<a href="https://robur-coop.github.io/miou/">here</a> and is part of the Miou distribution.
</p>

<p>
For any questions or assistance, we are available via email, this forum, or Discord.
</p>

<p>
Happy hacking!
</p>

<p>
<b>¹</b>: As explained in <a href="https://blog.robur.coop/articles/speeding-ec-string.html">this article</a>, we try to replace <code>Cstruct.t</code> by <code>string</code> and it requires
obviously a deep change across severals packages.
</p>
</div>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="5">OCaml.org Newsletter: March 2024</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-org-newsletter-march-2024/14431/1">https://discuss.ocaml.org/t/ocaml-org-newsletter-march-2024/14431/1</a>
</p>
</div>
<div id="outline-container-orgafceaa0" class="outline-3">
<h3 id="orgafceaa0">Sabine Schmaltz announced</h3>
<div class="outline-text-3" id="text-orgafceaa0">
<p>
Welcome to the March 2024 edition of the OCaml.org newsletter! This update has been compiled by the OCaml.org team. You can find
<a href="https://discuss.ocaml.org/tag/ocamlorg-newsletter">previous updates</a> on Discuss.
</p>

<p>
Our goal is to make OCaml.org the best resource for anyone who wants to get started and be productive in OCaml. The OCaml.org
newsletter provides an update on our progress towards that goal and an overview of the changes we are working on.
</p>

<p>
We couldn't do it without all the amazing OCaml community members who help us review, revise, and create better OCaml documentation.
Your feedback enables us to better prioritise our work. Thank you!
</p>

<p>
This newsletter covers:
</p>
<ul class="org-ul">
<li><b>OCaml Cookbook:</b> A prototype of an OCaml cookbook that provides short code examples that solve practical problems using packages from the OCaml ecosystem is on staging.ocaml.org/cookbook.</li>
<li><b>Dark Mode:</b> We enabled the dark mode on all pages of OCaml.org, based on your operating system / browser settings.</li>
<li><b>Community &amp; Marketing Pages Rework:</b> We are seeking feedback on wireframes for the community section and for the marketing-related pages.</li>
<li><b>General Improvements:</b> As usual, we also worked on general maintenance and improvements based on user feedback, so we're highlighting some of our work below.</li>
</ul>
</div>
<div id="outline-container-orge7bd6f8" class="outline-4">
<h4 id="orge7bd6f8">Open Issues for Contributors</h4>
<div class="outline-text-4" id="text-orge7bd6f8">
<p>
You can find <a href="https://github.com/ocaml/ocaml.org/issues?q=is%3Aissue+is%3Aopen+label%3A%22help+wanted%22+no%3Aassignee">open issues for contributors
here</a>!
</p>
</div>
</div>
