2024.04.09.org
*** Upcoming OCaml Cookbook

We're in the process of adding a community-driven section to the Learn area: the OCaml Cookbook. This cookbook is designed as a
collection of recipes, offering code samples for tackling real-world tasks using packages from the OCaml ecosystem. It's a practical
effort to enrich our learning resources, making them more applicable and useful for our community.

This month, our focus shifted towards finalizing the cookbook for release. This includes
- restructuring the directory structure and placement of recipe files, and
- adding tasks to the cookbook, so that you can contribute recipes for these tasks (we took inspiration from the excellent [[https://rust-lang-nursery.github.io/rust-cookbook/][Rust Cookbook]]).

It will always be possible to propose more tasks for the OCaml Cookbook. The main criteria here are:
1. task must require more than just a single Standard Library function call to solve,
2. task must be focused on common problems that occur when trying to build products,
3. if in doubt, make the task more specific, instead of more generic.

A good place to give feedback on the cookbook is [[https://discuss.ocaml.org/t/feedback-help-wanted-upcoming-ocaml-org-cookbook-feature/14127/10][this discuss
thread]].

*Relevant PRs and Activities:*
- [[https://github.com/ocaml/ocaml.org/pull/2133][(WIP) Cookbook compression / decompression]] by @F-Loyer
- [[https://github.com/ocaml/ocaml.org/pull/2127][Cookbook : fix in Lwt (type mismatch with iter_s/iter_p functions)]] by @F-Loyer
- [[https://github.com/ocaml/ocaml.org/pull/2126][Update 00-caqti-ppx-rapper.ml - fix caqti-driver-sqlite -> caqti-driver-sqlite3]] by @F-Loyer

*** Dark Mode Released

We're happy to anounce that we shipped the Dark Mode for OCaml.org. Dark mode is activated based on your operating system / browser
settings. If you see anything wrong, please open an issue and include the URL on which you're seeing a problem.

*Relevant PRs and Activities:*
- [[https://discuss.ocaml.org/t/announcing-the-new-dark-mode-on-ocaml-org/14273][Announce Dark Mode on Discuss]]
- [[https://github.com/ocaml/ocaml.org/pull/2159][Add Preliminary Dark Mode for Package Documentation]] by @sabine
- [[https://github.com/ocaml/ocaml.org/pull/2138][Fix: dark text color on blue background]] by @amarachigoodness74
- [[https://github.com/ocaml/ocaml.org/pull/2161][(dark mode) adjust breadcrumbs text color]] by @sabine
- [[https://github.com/ocaml/ocaml.org/pull/2160][(ui) Activate Dark Mode]] by @sabine
- [[https://github.com/ocaml/ocaml.org/pull/2191][Correctly invert text on "Is OCaml Web" page]] by @SquidDev
- [[https://github.com/ocaml/ocaml.org/pull/2299][fix: add missing darkmode styles for in-package search results]] by @sabine
- [[https://github.com/ocaml/ocaml.org/pull/2301][Remove legacy tailwind colors and styles, tidy up darkmode colors]] by @sabine

*** Homepage & Marketing Pages Rework

The Home page project kicked off with an analysis of user surveys and interviews, and the development of an initial wireframe for the
homepage and the "Industrial Users" and "Academic Users" pages.

We've been [[https://discuss.ocaml.org/t/academic-ocaml-users-testimonials/14338][reaching out to the community on Discuss]] and
Twitter to find what people say about OCaml, so we can give a bit more context through testimonials on the "Academic Users" page.

Besides this, we've been [[https://x.com/sabine_s_/status/1772264108479467629?s=20][asking on Twitter for ideas for the main tagline of the
homepage]]

You can comment on the wireframes in Figma
[[https://www.figma.com/file/eLNSdvayxqvvfBsRsdbJXN/OCaml-Home-Page?type=design&node-id=5%3A2500&mode=design&t=hHclskuVpoOzKP2u-1][here]].

If you have opinions on the homepage, feel free to share them in [[https://discuss.ocaml.org/t/your-feedback-needed-on-ocaml-home-page-wireframe/14366][this discuss
thread]]!

