2024.04.09.html
<div id="outline-container-orge0b5e18" class="outline-4">
<h4 id="orge0b5e18">Upcoming OCaml Cookbook</h4>
<div class="outline-text-4" id="text-orge0b5e18">
<p>
We're in the process of adding a community-driven section to the Learn area: the OCaml Cookbook. This cookbook is designed as a
collection of recipes, offering code samples for tackling real-world tasks using packages from the OCaml ecosystem. It's a practical
effort to enrich our learning resources, making them more applicable and useful for our community.
</p>

<p>
This month, our focus shifted towards finalizing the cookbook for release. This includes
</p>
<ul class="org-ul">
<li>restructuring the directory structure and placement of recipe files, and</li>
<li>adding tasks to the cookbook, so that you can contribute recipes for these tasks (we took inspiration from the excellent <a href="https://rust-lang-nursery.github.io/rust-cookbook/">Rust Cookbook</a>).</li>
</ul>

<p>
It will always be possible to propose more tasks for the OCaml Cookbook. The main criteria here are:
</p>
<ol class="org-ol">
<li>task must require more than just a single Standard Library function call to solve,</li>
<li>task must be focused on common problems that occur when trying to build products,</li>
<li>if in doubt, make the task more specific, instead of more generic.</li>
</ol>

<p>
A good place to give feedback on the cookbook is <a href="https://discuss.ocaml.org/t/feedback-help-wanted-upcoming-ocaml-org-cookbook-feature/14127/10">this discuss
thread</a>.
</p>

<p>
<b>Relevant PRs and Activities:</b>
</p>
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml.org/pull/2133">(WIP) Cookbook compression / decompression</a> by @F-Loyer</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2127">Cookbook : fix in Lwt (type mismatch with iter_s/iter_p functions)</a> by @F-Loyer</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2126">Update 00-caqti-ppx-rapper.ml - fix caqti-driver-sqlite -&gt; caqti-driver-sqlite3</a> by @F-Loyer</li>
</ul>
</div>
</div>
<div id="outline-container-org78a1374" class="outline-4">
<h4 id="org78a1374">Dark Mode Released</h4>
<div class="outline-text-4" id="text-org78a1374">
<p>
We're happy to anounce that we shipped the Dark Mode for OCaml.org. Dark mode is activated based on your operating system / browser
settings. If you see anything wrong, please open an issue and include the URL on which you're seeing a problem.
</p>

<p>
<b>Relevant PRs and Activities:</b>
</p>
<ul class="org-ul">
<li><a href="https://discuss.ocaml.org/t/announcing-the-new-dark-mode-on-ocaml-org/14273">Announce Dark Mode on Discuss</a></li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2159">Add Preliminary Dark Mode for Package Documentation</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2138">Fix: dark text color on blue background</a> by @amarachigoodness74</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2161">(dark mode) adjust breadcrumbs text color</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2160">(ui) Activate Dark Mode</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2191">Correctly invert text on "Is OCaml Web" page</a> by @SquidDev</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2299">fix: add missing darkmode styles for in-package search results</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2301">Remove legacy tailwind colors and styles, tidy up darkmode colors</a> by @sabine</li>
</ul>
</div>
</div>
<div id="outline-container-orgd9d3775" class="outline-4">
<h4 id="orgd9d3775">Homepage &amp; Marketing Pages Rework</h4>
<div class="outline-text-4" id="text-orgd9d3775">
<p>
The Home page project kicked off with an analysis of user surveys and interviews, and the development of an initial wireframe for the
homepage and the "Industrial Users" and "Academic Users" pages.
</p>

<p>
We've been <a href="https://discuss.ocaml.org/t/academic-ocaml-users-testimonials/14338">reaching out to the community on Discuss</a> and
Twitter to find what people say about OCaml, so we can give a bit more context through testimonials on the "Academic Users" page.
</p>

<p>
Besides this, we've been <a href="https://x.com/sabine_s_/status/1772264108479467629?s=20">asking on Twitter for ideas for the main tagline of the
homepage</a>
</p>

<p>
You can comment on the wireframes in Figma
<a href="https://www.figma.com/file/eLNSdvayxqvvfBsRsdbJXN/OCaml-Home-Page?type=design&amp;node-id=5%3A2500&amp;mode=design&amp;t=hHclskuVpoOzKP2u-1">here</a>.
</p>

<p>
If you have opinions on the homepage, feel free to share them in <a href="https://discuss.ocaml.org/t/your-feedback-needed-on-ocaml-home-page-wireframe/14366">this discuss
thread</a>!
</p>
</div>
</div>
