2024.04.09.txt


Upcoming OCaml Cookbook
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  We're in the process of adding a community-driven section to the Learn
  area: the OCaml Cookbook. This cookbook is designed as a collection of
  recipes, offering code samples for tackling real-world tasks using
  packages from the OCaml ecosystem. It's a practical effort to enrich
  our learning resources, making them more applicable and useful for our
  community.

  This month, our focus shifted towards finalizing the cookbook for
  release. This includes
  • restructuring the directory structure and placement of recipe files,
    and
  • adding tasks to the cookbook, so that you can contribute recipes for
    these tasks (we took inspiration from the excellent [Rust
    Cookbook]).

  It will always be possible to propose more tasks for the OCaml
  Cookbook. The main criteria here are:
  1. task must require more than just a single Standard Library function
     call to solve,
  2. task must be focused on common problems that occur when trying to
     build products,
  3. if in doubt, make the task more specific, instead of more generic.

  A good place to give feedback on the cookbook is [this discuss
  thread].

  *Relevant PRs and Activities:*
  • [(WIP) Cookbook compression / decompression] by @F-Loyer
  • [Cookbook : fix in Lwt (type mismatch with iter_s/iter_p functions)]
    by @F-Loyer
  • [Update 00-caqti-ppx-rapper.ml - fix caqti-driver-sqlite ->
    caqti-driver-sqlite3] by @F-Loyer


[Rust Cookbook] <https://rust-lang-nursery.github.io/rust-cookbook/>

[this discuss thread]
<https://discuss.ocaml.org/t/feedback-help-wanted-upcoming-ocaml-org-cookbook-feature/14127/10>

[(WIP) Cookbook compression / decompression]
<https://github.com/ocaml/ocaml.org/pull/2133>

[Cookbook : fix in Lwt (type mismatch with iter_s/iter_p functions)]
<https://github.com/ocaml/ocaml.org/pull/2127>

[Update 00-caqti-ppx-rapper.ml - fix caqti-driver-sqlite ->
caqti-driver-sqlite3] <https://github.com/ocaml/ocaml.org/pull/2126>


Dark Mode Released
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  We're happy to anounce that we shipped the Dark Mode for
  OCaml.org. Dark mode is activated based on your operating system /
  browser settings. If you see anything wrong, please open an issue and
  include the URL on which you're seeing a problem.

  *Relevant PRs and Activities:*
  • [Announce Dark Mode on Discuss]
  • [Add Preliminary Dark Mode for Package Documentation] by @sabine
  • [Fix: dark text color on blue background] by @amarachigoodness74
  • [(dark mode) adjust breadcrumbs text color] by @sabine
  • [(ui) Activate Dark Mode] by @sabine
  • [Correctly invert text on "Is OCaml Web" page] by @SquidDev
  • [fix: add missing darkmode styles for in-package search results] by
    @sabine
  • [Remove legacy tailwind colors and styles, tidy up darkmode colors]
    by @sabine


[Announce Dark Mode on Discuss]
<https://discuss.ocaml.org/t/announcing-the-new-dark-mode-on-ocaml-org/14273>

[Add Preliminary Dark Mode for Package Documentation]
<https://github.com/ocaml/ocaml.org/pull/2159>

[Fix: dark text color on blue background]
<https://github.com/ocaml/ocaml.org/pull/2138>

[(dark mode) adjust breadcrumbs text color]
<https://github.com/ocaml/ocaml.org/pull/2161>

[(ui) Activate Dark Mode] <https://github.com/ocaml/ocaml.org/pull/2160>

[Correctly invert text on "Is OCaml Web" page]
<https://github.com/ocaml/ocaml.org/pull/2191>

[fix: add missing darkmode styles for in-package search results]
<https://github.com/ocaml/ocaml.org/pull/2299>

[Remove legacy tailwind colors and styles, tidy up darkmode colors]
<https://github.com/ocaml/ocaml.org/pull/2301>


Homepage & Marketing Pages Rework
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  The Home page project kicked off with an analysis of user surveys and
  interviews, and the development of an initial wireframe for the
  homepage and the "Industrial Users" and "Academic Users" pages.

  We've been [reaching out to the community on Discuss] and Twitter to
  find what people say about OCaml, so we can give a bit more context
  through testimonials on the "Academic Users" page.

  Besides this, we've been [asking on Twitter for ideas for the main
  tagline of the homepage]

  You can comment on the wireframes in Figma [here].

  If you have opinions on the homepage, feel free to share them in [this
  discuss thread]!


[reaching out to the community on Discuss]
<https://discuss.ocaml.org/t/academic-ocaml-users-testimonials/14338>

[asking on Twitter for ideas for the main tagline of the homepage]
<https://x.com/sabine_s_/status/1772264108479467629?s=20>

[here]
<https://www.figma.com/file/eLNSdvayxqvvfBsRsdbJXN/OCaml-Home-Page?type=design&node-id=5%3A2500&mode=design&t=hHclskuVpoOzKP2u-1>

[this discuss thread]
<https://discuss.ocaml.org/t/your-feedback-needed-on-ocaml-home-page-wireframe/14366>
