2024.04.09.html
<div id="outline-container-orgeea2207" class="outline-4">
<h4 id="orgeea2207">Community Section Rework</h4>
<div class="outline-text-4" id="text-orgeea2207">
<p>
This week, we focused on creating wireframes for the Event, Job, Internship, and Workshop pages, followed by soliciting feedback from
the community via Discuss. Concurrently, work commenced on the UI design for the Community Landing page, as well as the Event and Job
pages.
</p>

<p>
We also made some improvements to the Events section on the Community page. This involves better treatment of start/end times of
events, as well as listing more upcoming events.
</p>

<p>
If you have opinions on the community section, feel free to share them in <a href="https://discuss.ocaml.org/t/looking-for-ideas-for-the-community-page-at-ocaml-org/14032/9">this discuss
thread</a>!
</p>

<p>
<b>Relevant PRs and Activities:</b>
</p>
<ul class="org-ul">
<li>Invite people to add events to events directory: <a href="https://discuss.ocaml.org/t/add-your-ocaml-events-to-the-community-page-on-ocaml-org/14251">https://discuss.ocaml.org/t/add-your-ocaml-events-to-the-community-page-on-ocaml-org/14251</a></li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2132">Improve Events Directory</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2136">Fix template bug on upcoming events list</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2307">Make clear upcoming event time is UTC</a> by @sabine</li>
<li>Data contributed to events:
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml.org/pull/2135">(data) Add S-REPLS event</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2143">(data) fix wrong date on event</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2134">(data) Add OCaml Retreat Auroville</a> by @D8kTwoXfSUWLdpXruFrQiw</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2305">(data) add OCaml Manila Meetup</a> by @sabine</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb05b1ef" class="outline-4">
<h4 id="orgb05b1ef">Outreachy Application Period &amp; Internship</h4>
<div class="outline-text-4" id="text-orgb05b1ef">
<p>
In March, OCaml.org hosted the application period for one <a href="https://www.outreachy.org/">Outreachy internship</a> on creating an
interactive experience for solving OCaml exercises.
</p>

<p>
The process of selecting an Outreachy intern involved creating and managing 15 issues, reviewing 61 pull requests from 8 applicants.
The tasks were similar in nature and dealt with restructuring the exercises to enable an interactive experience, adding test cases
and solutions (where missing).
</p>

<p>
<b>Relevant PRs and Activities:</b>
</p>
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml.org/pull/2166">Create practice folder</a> by @cuihtlauac</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2227">Sort exercises by slug before emitting template</a> by @csaltachin</li>
<li>Turning exercises into practice @Ozyugoo, @mnaibei, @divyankachaudhari, @Kxrishx03, @maha-sachin, @MissJae, @jahielkomu, @Appleeyes</li>
</ul>
</div>
</div>
