2024.04.09.txt


Community Section Rework
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  This week, we focused on creating wireframes for the Event, Job,
  Internship, and Workshop pages, followed by soliciting feedback from
  the community via Discuss. Concurrently, work commenced on the UI
  design for the Community Landing page, as well as the Event and Job
  pages.

  We also made some improvements to the Events section on the Community
  page. This involves better treatment of start/end times of events, as
  well as listing more upcoming events.

  If you have opinions on the community section, feel free to share them
  in [this discuss thread]!

  *Relevant PRs and Activities:*
  • Invite people to add events to events directory:
    <https://discuss.ocaml.org/t/add-your-ocaml-events-to-the-community-page-on-ocaml-org/14251>
  • [Improve Events Directory] by @sabine
  • [Fix template bug on upcoming events list] by @sabine
  • [Make clear upcoming event time is UTC] by @sabine
  • Data contributed to events:
    • [(data) Add S-REPLS event] by @sabine
    • [(data) fix wrong date on event] by @sabine
    • [(data) Add OCaml Retreat Auroville] by @D8kTwoXfSUWLdpXruFrQiw
    • [(data) add OCaml Manila Meetup] by @sabine


[this discuss thread]
<https://discuss.ocaml.org/t/looking-for-ideas-for-the-community-page-at-ocaml-org/14032/9>

[Improve Events Directory]
<https://github.com/ocaml/ocaml.org/pull/2132>

[Fix template bug on upcoming events list]
<https://github.com/ocaml/ocaml.org/pull/2136>

[Make clear upcoming event time is UTC]
<https://github.com/ocaml/ocaml.org/pull/2307>

[(data) Add S-REPLS event]
<https://github.com/ocaml/ocaml.org/pull/2135>

[(data) fix wrong date on event]
<https://github.com/ocaml/ocaml.org/pull/2143>

[(data) Add OCaml Retreat Auroville]
<https://github.com/ocaml/ocaml.org/pull/2134>

[(data) add OCaml Manila Meetup]
<https://github.com/ocaml/ocaml.org/pull/2305>


Outreachy Application Period & Internship
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  In March, OCaml.org hosted the application period for one [Outreachy
  internship] on creating an interactive experience for solving OCaml
  exercises.

  The process of selecting an Outreachy intern involved creating and
  managing 15 issues, reviewing 61 pull requests from 8 applicants.  The
  tasks were similar in nature and dealt with restructuring the
  exercises to enable an interactive experience, adding test cases and
  solutions (where missing).

  *Relevant PRs and Activities:*
  • [Create practice folder] by @cuihtlauac
  • [Sort exercises by slug before emitting template] by @csaltachin
  • Turning exercises into practice @Ozyugoo, @mnaibei,
    @divyankachaudhari, @Kxrishx03, @maha-sachin, @MissJae, @jahielkomu,
    @Appleeyes


[Outreachy internship] <https://www.outreachy.org/>

[Create practice folder] <https://github.com/ocaml/ocaml.org/pull/2166>

[Sort exercises by slug before emitting template]
<https://github.com/ocaml/ocaml.org/pull/2227>
