2024.04.09.org
*** General Improvements and Data Additions

*Relevant PRs and Activities:*
- (WIP) we're moving the OCaml Language Manual from v2.ocaml.org to ocaml.org
- set up dlvr.it to automatically post RSS feed items from OCaml Planet and OCaml Changelog to new ocaml_org Twitter account
- [[https://github.com/ocaml/ocaml.org/pull/2128][Link to recently added videos on watch.ocaml.org]] by @sabine
- [[https://github.com/ocaml/ocaml.org/pull/2111][Change twitter account from OCamlLang to ocaml_org]] by @sabine
- [[https://github.com/ocaml/ocaml.org/pull/2295][fix: small improvements on news.eml]] by @sabine
- [[https://github.com/ocaml/ocaml.org/pull/2303][is yet category slug]] by @cuihtlauac
- [[https://github.com/ocaml/ocaml.org/pull/2241][Add a badge from the green web foundation to the carbon footprint page]] by @0xrotense
- Deployment of odoc 2.4.1 to package documentation pipeline:
    - [[https://github.com/ocaml-doc/voodoo/pull/128][Compatibility with odoc.2.4.1]] by @gpetiot
    - [[https://github.com/ocaml/ocaml.org/pull/2300][Patch for voodoo / odoc 2.4.1 upgrade]] by @sabine
    - [[https://github.com/ocaml/ocaml.org/pull/2304][chore: set doc url to live, after voodoo upgrade]] by @sabine
- Data:
    - [[https://github.com/ocaml/ocaml.org/pull/2154][(data) add ocaml.org newsletter February]] by @sabine
    - [[https://github.com/ocaml/ocaml.org/pull/2145][Changelog entry for OCaml 4.14.2~rc1]] by @Octachron
    - [[https://github.com/ocaml/ocaml.org/pull/2190][Add dune.3.14.2 announcement]] by @Leonidas-from-XIV
    - [[https://github.com/ocaml/ocaml.org/pull/2225][OCaml 4.14.2 release and changelog pages]] by @Octachron
    - [[https://github.com/ocaml/ocaml.org/pull/2286][OCaml 4.14.2: fix release year]] by @edwintorok
    - [[https://github.com/ocaml/ocaml.org/pull/2288][Add Platform changelogs for February 2024]] by @tmattio
    - [[https://github.com/ocaml/ocaml.org/pull/2291][Changelog entry for OCaml 5.2.0~beta1]] by @Octachron
    - [[https://github.com/ocaml/ocaml.org/pull/2244][Add Outreachy winter 2023 round]] by @patricoferris
- Documentation:
  - [[https://github.com/ocaml/ocaml.org/pull/2094][DOC: note about windows ppx_show]] by @heathhenley
  - [[https://github.com/ocaml/ocaml.org/pull/2152][(docs) Fix small typos]] by @kenranunderscore
  - [[https://github.com/ocaml/ocaml.org/pull/2146][(docs) Add link for instances of Array]] by @rmeis06
  - [[https://github.com/ocaml/ocaml.org/pull/2148][Linking exercise to tutorials]] by @rmeis06
  - [[https://github.com/ocaml/ocaml.org/pull/2157][Explain why t-first works with labels ]] by @mikhailazaryan
  - [[https://github.com/ocaml/ocaml.org/pull/2147][Document that begin ... end use]] by @rmeis06
  - [[https://github.com/ocaml/ocaml.org/pull/2183][Use uniform syntax for eval steps]] by @cuihtlauac 
  - [[https://github.com/ocaml/ocaml.org/pull/2153][Linking mentions of atomic module to doc]] by @rmeis06
  - [[https://github.com/ocaml/ocaml.org/pull/2163][Linking Bigarray references]] by @rmeis06
  - [[https://github.com/ocaml/ocaml.org/pull/2247][(docs) fix example in 'Libraries With Dune']] by @0xRamsi
  - [[https://github.com/ocaml/ocaml.org/pull/2219][Fix typo in 4ad_01_operators.md]] by @vog
  - [[https://github.com/ocaml/ocaml.org/pull/2249][(docs) Use DkML 2.1.0]] by @jonahbeckford
      



* Opam 102: Pinning Packages, by OCamlPro
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/blog-opam-102-pinning-packages-by-ocamlpro/14437/1

** OCamlPro announced


Greetings Cameleers,

Here’s another heads up for all opam users: [[https://ocamlpro.com/blog/2024_03_25_opam_102_pinning_packages/][Opam 102: Pinning
Packages]], our latest blog post breaking down opam for the
community; as a keen eye would have already guessed, today's subject is package pinning!

We hope that this may be useful to anybody curious about getting acquainted with opam's pins. This article is made for whom wonders
how they work and when they are useful to be aware of.

Hoping that it may serve as a reference for all newcomers to the ecosystem.

We appreciate and are thankful for every reader, we welcome all your feedback, right here, in this thread. :smile: 

Kind regards,
The OCamlPro Team
      



* dune 3.15
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/ann-dune-3-15/14438/1

