2024.04.09.html
<div id="outline-container-org4f740a5" class="outline-4">
<h4 id="org4f740a5">General Improvements and Data Additions</h4>
<div class="outline-text-4" id="text-org4f740a5">
<p>
<b>Relevant PRs and Activities:</b>
</p>
<ul class="org-ul">
<li>(WIP) we're moving the OCaml Language Manual from v2.ocaml.org to ocaml.org</li>
<li>set up dlvr.it to automatically post RSS feed items from OCaml Planet and OCaml Changelog to new ocaml_org Twitter account</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2128">Link to recently added videos on watch.ocaml.org</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2111">Change twitter account from OCamlLang to ocaml_org</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2295">fix: small improvements on news.eml</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2303">is yet category slug</a> by @cuihtlauac</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2241">Add a badge from the green web foundation to the carbon footprint page</a> by @0xrotense</li>
<li>Deployment of odoc 2.4.1 to package documentation pipeline:
<ul class="org-ul">
<li><a href="https://github.com/ocaml-doc/voodoo/pull/128">Compatibility with odoc.2.4.1</a> by @gpetiot</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2300">Patch for voodoo / odoc 2.4.1 upgrade</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2304">chore: set doc url to live, after voodoo upgrade</a> by @sabine</li>
</ul></li>
<li>Data:
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml.org/pull/2154">(data) add ocaml.org newsletter February</a> by @sabine</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2145">Changelog entry for OCaml 4.14.2~rc1</a> by @Octachron</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2190">Add dune.3.14.2 announcement</a> by @Leonidas-from-XIV</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2225">OCaml 4.14.2 release and changelog pages</a> by @Octachron</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2286">OCaml 4.14.2: fix release year</a> by @edwintorok</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2288">Add Platform changelogs for February 2024</a> by @tmattio</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2291">Changelog entry for OCaml 5.2.0~beta1</a> by @Octachron</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2244">Add Outreachy winter 2023 round</a> by @patricoferris</li>
</ul></li>
<li>Documentation:
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml.org/pull/2094">DOC: note about windows ppx_show</a> by @heathhenley</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2152">(docs) Fix small typos</a> by @kenranunderscore</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2146">(docs) Add link for instances of Array</a> by @rmeis06</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2148">Linking exercise to tutorials</a> by @rmeis06</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2157">Explain why t-first works with labels </a> by @mikhailazaryan</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2147">Document that begin &#x2026; end use</a> by @rmeis06</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2183">Use uniform syntax for eval steps</a> by @cuihtlauac</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2153">Linking mentions of atomic module to doc</a> by @rmeis06</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2163">Linking Bigarray references</a> by @rmeis06</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2247">(docs) fix example in 'Libraries With Dune'</a> by @0xRamsi</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2219">Fix typo in 4ad_01_operators.md</a> by @vog</li>
<li><a href="https://github.com/ocaml/ocaml.org/pull/2249">(docs) Use DkML 2.1.0</a> by @jonahbeckford</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-6" class="outline-2">
<h2 id="6">Opam 102: Pinning Packages, by OCamlPro</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/blog-opam-102-pinning-packages-by-ocamlpro/14437/1">https://discuss.ocaml.org/t/blog-opam-102-pinning-packages-by-ocamlpro/14437/1</a>
</p>
</div>
<div id="outline-container-org1e300a5" class="outline-3">
<h3 id="org1e300a5">OCamlPro announced</h3>
<div class="outline-text-3" id="text-org1e300a5">
<p>
Greetings Cameleers,
</p>

<p>
Here’s another heads up for all opam users: <a href="https://ocamlpro.com/blog/2024_03_25_opam_102_pinning_packages/">Opam 102: Pinning
Packages</a>, our latest blog post breaking down opam for the
community; as a keen eye would have already guessed, today's subject is package pinning!
</p>

<p>
We hope that this may be useful to anybody curious about getting acquainted with opam's pins. This article is made for whom wonders
how they work and when they are useful to be aware of.
</p>

<p>
Hoping that it may serve as a reference for all newcomers to the ecosystem.
</p>

<p>
We appreciate and are thankful for every reader, we welcome all your feedback, right here, in this thread. :smile: 
</p>

<p>
Kind regards,
The OCamlPro Team
</p>
</div>
</div>
</div>
<div id="outline-container-7" class="outline-2">
<h2 id="7">dune 3.15</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-3-15/14438/1">https://discuss.ocaml.org/t/ann-dune-3-15/14438/1</a>
</p>
</div>
