2024.04.09.txt


General Improvements and Data Additions
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  *Relevant PRs and Activities:*
  • (WIP) we're moving the OCaml Language Manual from v2.ocaml.org to
    ocaml.org
  • set up dlvr.it to automatically post RSS feed items from OCaml
    Planet and OCaml Changelog to new ocaml_org Twitter account
  • [Link to recently added videos on watch.ocaml.org] by @sabine
  • [Change twitter account from OCamlLang to ocaml_org] by @sabine
  • [fix: small improvements on news.eml] by @sabine
  • [is yet category slug] by @cuihtlauac
  • [Add a badge from the green web foundation to the carbon footprint
    page] by @0xrotense
  • Deployment of odoc 2.4.1 to package documentation pipeline:
    • [Compatibility with odoc.2.4.1] by @gpetiot
    • [Patch for voodoo / odoc 2.4.1 upgrade] by @sabine
    • [chore: set doc url to live, after voodoo upgrade] by @sabine
  • Data:
    • [(data) add ocaml.org newsletter February] by @sabine
    • [Changelog entry for OCaml 4.14.2~rc1] by @Octachron
    • [Add dune.3.14.2 announcement] by @Leonidas-from-XIV
    • [OCaml 4.14.2 release and changelog pages] by @Octachron
    • [OCaml 4.14.2: fix release year] by @edwintorok
    • [Add Platform changelogs for February 2024] by @tmattio
    • [Changelog entry for OCaml 5.2.0~beta1] by @Octachron
    • [Add Outreachy winter 2023 round] by @patricoferris
  • Documentation:
    • [DOC: note about windows ppx_show] by @heathhenley
    • [(docs) Fix small typos] by @kenranunderscore
    • [(docs) Add link for instances of Array] by @rmeis06
    • [Linking exercise to tutorials] by @rmeis06
    • [Explain why t-first works with labels ] by @mikhailazaryan
    • [Document that begin … end use] by @rmeis06
    • [Use uniform syntax for eval steps] by @cuihtlauac
    • [Linking mentions of atomic module to doc] by @rmeis06
    • [Linking Bigarray references] by @rmeis06
    • [(docs) fix example in 'Libraries With Dune'] by @0xRamsi
    • [Fix typo in 4ad_01_operators.md] by @vog
    • [(docs) Use DkML 2.1.0] by @jonahbeckford


[Link to recently added videos on watch.ocaml.org]
<https://github.com/ocaml/ocaml.org/pull/2128>

[Change twitter account from OCamlLang to ocaml_org]
<https://github.com/ocaml/ocaml.org/pull/2111>

[fix: small improvements on news.eml]
<https://github.com/ocaml/ocaml.org/pull/2295>

[is yet category slug] <https://github.com/ocaml/ocaml.org/pull/2303>

[Add a badge from the green web foundation to the carbon footprint page]
<https://github.com/ocaml/ocaml.org/pull/2241>

[Compatibility with odoc.2.4.1]
<https://github.com/ocaml-doc/voodoo/pull/128>

[Patch for voodoo / odoc 2.4.1 upgrade]
<https://github.com/ocaml/ocaml.org/pull/2300>

[chore: set doc url to live, after voodoo upgrade]
<https://github.com/ocaml/ocaml.org/pull/2304>

[(data) add ocaml.org newsletter February]
<https://github.com/ocaml/ocaml.org/pull/2154>

[Changelog entry for OCaml 4.14.2~rc1]
<https://github.com/ocaml/ocaml.org/pull/2145>

[Add dune.3.14.2 announcement]
<https://github.com/ocaml/ocaml.org/pull/2190>

[OCaml 4.14.2 release and changelog pages]
<https://github.com/ocaml/ocaml.org/pull/2225>

[OCaml 4.14.2: fix release year]
<https://github.com/ocaml/ocaml.org/pull/2286>

[Add Platform changelogs for February 2024]
<https://github.com/ocaml/ocaml.org/pull/2288>

[Changelog entry for OCaml 5.2.0~beta1]
<https://github.com/ocaml/ocaml.org/pull/2291>

[Add Outreachy winter 2023 round]
<https://github.com/ocaml/ocaml.org/pull/2244>

[DOC: note about windows ppx_show]
<https://github.com/ocaml/ocaml.org/pull/2094>

[(docs) Fix small typos] <https://github.com/ocaml/ocaml.org/pull/2152>

[(docs) Add link for instances of Array]
<https://github.com/ocaml/ocaml.org/pull/2146>

[Linking exercise to tutorials]
<https://github.com/ocaml/ocaml.org/pull/2148>

[Explain why t-first works with labels ]
<https://github.com/ocaml/ocaml.org/pull/2157>

[Document that begin … end use]
<https://github.com/ocaml/ocaml.org/pull/2147>

[Use uniform syntax for eval steps]
<https://github.com/ocaml/ocaml.org/pull/2183>

[Linking mentions of atomic module to doc]
<https://github.com/ocaml/ocaml.org/pull/2153>

[Linking Bigarray references]
<https://github.com/ocaml/ocaml.org/pull/2163>

[(docs) fix example in 'Libraries With Dune']
<https://github.com/ocaml/ocaml.org/pull/2247>

[Fix typo in 4ad_01_operators.md]
<https://github.com/ocaml/ocaml.org/pull/2219>

[(docs) Use DkML 2.1.0] <https://github.com/ocaml/ocaml.org/pull/2249>


Opam 102: Pinning Packages, by OCamlPro
═══════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/blog-opam-102-pinning-packages-by-ocamlpro/14437/1>


OCamlPro announced
──────────────────

  Greetings Cameleers,

  Here’s another heads up for all opam users: [Opam 102: Pinning
  Packages], our latest blog post breaking down opam for the community;
  as a keen eye would have already guessed, today's subject is package
  pinning!

  We hope that this may be useful to anybody curious about getting
  acquainted with opam's pins. This article is made for whom wonders how
  they work and when they are useful to be aware of.

  Hoping that it may serve as a reference for all newcomers to the
  ecosystem.

  We appreciate and are thankful for every reader, we welcome all your
  feedback, right here, in this thread. :smile:

  Kind regards, The OCamlPro Team


[Opam 102: Pinning Packages]
<https://ocamlpro.com/blog/2024_03_25_opam_102_pinning_packages/>


dune 3.15
═════════

  Archive: <https://discuss.ocaml.org/t/ann-dune-3-15/14438/1>
