2024.04.09.org
** Marek Kubica announced


We're happy to announce that Dune 3.15.0 is now available. This feature has many fixes and new features that you can find in the
changelog.

There are a few new features that we would like to specially highlight.

*** Removal of previous limitations in many forms

Prior to Dune 3.15 there were a number of limitations where percent forms like ~%{env:...}~ could be used to expand to useful values.
In this release, @rgrinberg put some effort to relax a lot of these restrictions where possible.

In the new version some of these limitations have been lifted, so for example ~{env:...}~ can be used in ~install~ stanzas
([[https://github.com/ocaml/dune/pull/10160][#10160]]).

Likewise there was no consistency where ~%{cma:...}~ or ~%{cmo:...}~ could be used. With
[[https://github.com/ocaml/dune/pull/10169][#10169]], these forms should work consistently everywhere.

Similarly the variables allowed in ~enabled_if~ fields have been expanded in [[https://github.com/ocaml/dune/pull/10250][#10250]], from
just allowing variables that can be computed from the context to now allowing all variables as long as expanding these variables does
not introduce dependency cycles.

These relaxed rules can also be combined to enable a library depending on environment variables, e.g. ~(enabled_if
%{env:ENABLE_LIBFOO=false}))~.

*** Overlapping names in different contexts

Continuing the theme of conditionally enabling or disabling code to be built,
@jchavarri and @rgrinberg's work on [[https://github.com/ocaml/dune/pull/10220][#10220]] makes it possible to have overlapping names
between ~executable~ and ~melange.emit~ targets. This can be useful when a name is to be shared in different contexts (e.g. one
context with native compilation and one emitting code for the browser).

*** Properly output UTF-8 encoded text when formatting

Dune does not assume an encoding of dune files, however when files were formatted the formatter would err on the safe side and escape
bytes outside the ASCII range. This means that UTF-8 characters outside of ASCII would get escaped into decimal escape sequences.

This was especially annoying in places where the user would write natural language texts, which is common when defining Opam packages
in ~dune-project~ files. For example a discussion of a paper by Paul Erdős, Peter Frankl, Vojtěch Rödl would upon reformatting be
turned into Paul Erd\\197\\145s, Peter Frankl, Vojt\\196\\155 R\\195\\182, which does a disservice to these scientists and is hard to
read.

Thanks to the work of @moyodiallo in [[https://github.com/ocaml/dune/pull/9728][#9728]] starting with Dune 3.15 the original encoding
will be preserved, so your package descriptions will be more readable.

*** Changelog

**** Added

- Add link flags to to ~ocamlmklib~ for ctypes stubs (#8784, @frejsoya)
- Remove some unnecessary limitations in the expansions of percent forms in install stanza. For example, the ~%{env:..}~ form can be used to select files to be installed. (#10160, @rgrinberg)
- Allow artifact expansion percent forms (~%{cma:..}~, ~%{cmo:..}~, etc.) in more contexts. Previously, they would be randomly forbidden in some fields. (#10169, @rgrinberg)
- Allow ~%{inline_tests}~ in more contexts (#10191, @rgrinberg)
- Remove limitations on percent forms in the ~(enabled_if ..)~ field of libraries (#10250, @rgrinberg)
- Support dialects in ~dune describe pp~ (#10283, @emillon)
- Allow defining executables or melange emit stanzas with the same name in the same folder under different contexts. (#10220, @rgrinberg, @jchavarri)

