2024.04.09.html
<div id="outline-container-org3ccd36e" class="outline-3">
<h3 id="org3ccd36e">Marek Kubica announced</h3>
<div class="outline-text-3" id="text-org3ccd36e">
<p>
We're happy to announce that Dune 3.15.0 is now available. This feature has many fixes and new features that you can find in the
changelog.
</p>

<p>
There are a few new features that we would like to specially highlight.
</p>
</div>
<div id="outline-container-org49a0359" class="outline-4">
<h4 id="org49a0359">Removal of previous limitations in many forms</h4>
<div class="outline-text-4" id="text-org49a0359">
<p>
Prior to Dune 3.15 there were a number of limitations where percent forms like <code>%{env:...}</code> could be used to expand to useful values.
In this release, @rgrinberg put some effort to relax a lot of these restrictions where possible.
</p>

<p>
In the new version some of these limitations have been lifted, so for example <code>{env:...}</code> can be used in <code>install</code> stanzas
(<a href="https://github.com/ocaml/dune/pull/10160">#10160</a>).
</p>

<p>
Likewise there was no consistency where <code>%{cma:...}</code> or <code>%{cmo:...}</code> could be used. With
<a href="https://github.com/ocaml/dune/pull/10169">#10169</a>, these forms should work consistently everywhere.
</p>

<p>
Similarly the variables allowed in <code>enabled_if</code> fields have been expanded in <a href="https://github.com/ocaml/dune/pull/10250">#10250</a>, from
just allowing variables that can be computed from the context to now allowing all variables as long as expanding these variables does
not introduce dependency cycles.
</p>

<p>
These relaxed rules can also be combined to enable a library depending on environment variables, e.g. <code>(enabled_if
%{env:ENABLE_LIBFOO=false}))</code>.
</p>
</div>
</div>
<div id="outline-container-org1315f80" class="outline-4">
<h4 id="org1315f80">Overlapping names in different contexts</h4>
<div class="outline-text-4" id="text-org1315f80">
<p>
Continuing the theme of conditionally enabling or disabling code to be built,
@jchavarri and @rgrinberg's work on <a href="https://github.com/ocaml/dune/pull/10220">#10220</a> makes it possible to have overlapping names
between <code>executable</code> and <code>melange.emit</code> targets. This can be useful when a name is to be shared in different contexts (e.g. one
context with native compilation and one emitting code for the browser).
</p>
</div>
</div>
<div id="outline-container-org4676412" class="outline-4">
<h4 id="org4676412">Properly output UTF-8 encoded text when formatting</h4>
<div class="outline-text-4" id="text-org4676412">
<p>
Dune does not assume an encoding of dune files, however when files were formatted the formatter would err on the safe side and escape
bytes outside the ASCII range. This means that UTF-8 characters outside of ASCII would get escaped into decimal escape sequences.
</p>

<p>
This was especially annoying in places where the user would write natural language texts, which is common when defining Opam packages
in <code>dune-project</code> files. For example a discussion of a paper by Paul Erdős, Peter Frankl, Vojtěch Rödl would upon reformatting be
turned into Paul Erd\\197\\145s, Peter Frankl, Vojt\\196\\155 R\\195\\182, which does a disservice to these scientists and is hard to
read.
</p>

<p>
Thanks to the work of @moyodiallo in <a href="https://github.com/ocaml/dune/pull/9728">#9728</a> starting with Dune 3.15 the original encoding
will be preserved, so your package descriptions will be more readable.
</p>
</div>
</div>
<div id="outline-container-orgf0920ff" class="outline-4">
<h4 id="orgf0920ff">Changelog</h4>
<div class="outline-text-4" id="text-orgf0920ff">
</div>
<ul class="org-ul">
<li><a id="orgac86598"></a>Added<br />
<div class="outline-text-5" id="text-orgac86598">
<ul class="org-ul">
<li>Add link flags to to <code>ocamlmklib</code> for ctypes stubs (#8784, @frejsoya)</li>
<li>Remove some unnecessary limitations in the expansions of percent forms in install stanza. For example, the <code>%{env:..}</code> form can be used to select files to be installed. (#10160, @rgrinberg)</li>
<li>Allow artifact expansion percent forms (<code>%{cma:..}</code>, <code>%{cmo:..}</code>, etc.) in more contexts. Previously, they would be randomly forbidden in some fields. (#10169, @rgrinberg)</li>
<li>Allow <code>%{inline_tests}</code> in more contexts (#10191, @rgrinberg)</li>
<li>Remove limitations on percent forms in the <code>(enabled_if ..)</code> field of libraries (#10250, @rgrinberg)</li>
<li>Support dialects in <code>dune describe pp</code> (#10283, @emillon)</li>
<li>Allow defining executables or melange emit stanzas with the same name in the same folder under different contexts. (#10220, @rgrinberg, @jchavarri)</li>
</ul>
</div>
</li>
