2024.04.09.org
**** Fixed

- coq: Delay Coq rule setup checks so OCaml-only packages can build in hybrid Coq/OCaml projects when ~coqc~ is not present. Thanks to @vzaliva for the test case and report (#9845, fixes #9818, @rgrinberg, @ejgallego)
- Fix conditional source selection with ~select~ on ~bigarray~ in OCaml 5 (#10011, @moyodiallo)
- melange: fix inconsistency in virtual library implementation. Concrete modules within a virtual library can now refer to its virtual modules too (#10051, fixes #7104, @anmonteiro)
- melange: fix a bug that would cause stale ~import~ paths to be emitted when moving source files within ~(include_subdirs ..)~ (#10286, fixes #9190, @anmonteiro)
- Dune file formatting: output utf8 if input is correctly encoded (#10113, fixes #9728, @moyodiallo)
- Fix expanding dependencies and locks specified in the cram stanza. Previously, they would be installed in the context of the cram test, rather than the cram stanza itself (#10165, @rgrinberg)
- Fix bug with ~dune exec --watch~ where the working directory would always be set to the project root rather than the directory where the command was run (#10262, @gridbugs)
- Regression fix: sign executables that are promoted into the source tree (#10263, fixes #9272, @emillon)
- Fix crash when decoding dune-package for libraries with ~(include_subdirs qualified)~ (#10269, fixes #10264, @emillon)

*** Changed

- Remove the ~--react-to-insignificant-changes~ option. (#10083, @rgrinberg)
      



* Ocsigen: summary of recent releases
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/ocsigen-summary-of-recent-releases/13817/8

** Vincent Balat announced


Eliom 10.4:
- Basic client-server distillery template: sqlite is now the default backend
- Basic template now has license unlicense
- Basic template fixes
- Compatibility with Tyxml >= 4.6.0 (by Vincent Laporte)

Ocsigen Start 6.3
- Adding license Unlicense to the template
- Dependecy to Tyxml >= 4.6
      



* Js_of_ocaml 5.7
:PROPERTIES:
:CUSTOM_ID: 9
:END:
Archive: https://discuss.ocaml.org/t/ann-js-of-ocaml-5-7/14191/3

** Hhugo announced


Js_of_ocaml 5.7.2 was released recently. It adds missing primitives required by OCaml 5.2.0~beta
      



* Eio Developer Meetings
:PROPERTIES:
:CUSTOM_ID: 10
:END:
Archive: https://discuss.ocaml.org/t/eio-developer-meetings/12207/5

** Sudha Parimala announced


Following the release of Eio 1.0 (https://discuss.ocaml.org/t/ann-eio-1-0-first-major-release/14334), Eio goes into maintenance mode
for a bit. We've decided to pause the Eio developer meetings until further notice. Meanwhile, we remain active on the [[https://github.com/ocaml-multicore/eio/issues][issue
tracker]] and the [[https://matrix.to/#/#eio:roscidus.com][matrix channel]]. I encourage
folks to try out Eio and report their findings.
      



* Ocaml developer at Routine, Paris
:PROPERTIES:
:CUSTOM_ID: 11
:END:
Archive: https://discuss.ocaml.org/t/job-ocaml-developer-at-routine-paris/14448/1

