2024.04.09.html
<li><a id="orgedb0257"></a>Fixed<br />
<div class="outline-text-5" id="text-orgedb0257">
<ul class="org-ul">
<li>coq: Delay Coq rule setup checks so OCaml-only packages can build in hybrid Coq/OCaml projects when <code>coqc</code> is not present. Thanks to @vzaliva for the test case and report (#9845, fixes #9818, @rgrinberg, @ejgallego)</li>
<li>Fix conditional source selection with <code>select</code> on <code>bigarray</code> in OCaml 5 (#10011, @moyodiallo)</li>
<li>melange: fix inconsistency in virtual library implementation. Concrete modules within a virtual library can now refer to its virtual modules too (#10051, fixes #7104, @anmonteiro)</li>
<li>melange: fix a bug that would cause stale <code>import</code> paths to be emitted when moving source files within <code>(include_subdirs ..)</code> (#10286, fixes #9190, @anmonteiro)</li>
<li>Dune file formatting: output utf8 if input is correctly encoded (#10113, fixes #9728, @moyodiallo)</li>
<li>Fix expanding dependencies and locks specified in the cram stanza. Previously, they would be installed in the context of the cram test, rather than the cram stanza itself (#10165, @rgrinberg)</li>
<li>Fix bug with <code>dune exec --watch</code> where the working directory would always be set to the project root rather than the directory where the command was run (#10262, @gridbugs)</li>
<li>Regression fix: sign executables that are promoted into the source tree (#10263, fixes #9272, @emillon)</li>
<li>Fix crash when decoding dune-package for libraries with <code>(include_subdirs qualified)</code> (#10269, fixes #10264, @emillon)</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org13265cf" class="outline-4">
<h4 id="org13265cf">Changed</h4>
<div class="outline-text-4" id="text-org13265cf">
<ul class="org-ul">
<li>Remove the <code>--react-to-insignificant-changes</code> option. (#10083, @rgrinberg)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-8" class="outline-2">
<h2 id="8">Ocsigen: summary of recent releases</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocsigen-summary-of-recent-releases/13817/8">https://discuss.ocaml.org/t/ocsigen-summary-of-recent-releases/13817/8</a>
</p>
</div>
<div id="outline-container-orga9447c0" class="outline-3">
<h3 id="orga9447c0">Vincent Balat announced</h3>
<div class="outline-text-3" id="text-orga9447c0">
<p>
Eliom 10.4:
</p>
<ul class="org-ul">
<li>Basic client-server distillery template: sqlite is now the default backend</li>
<li>Basic template now has license unlicense</li>
<li>Basic template fixes</li>
<li>Compatibility with Tyxml &gt;= 4.6.0 (by Vincent Laporte)</li>
</ul>

<p>
Ocsigen Start 6.3
</p>
<ul class="org-ul">
<li>Adding license Unlicense to the template</li>
<li>Dependecy to Tyxml &gt;= 4.6</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-9" class="outline-2">
<h2 id="9">Js_of_ocaml 5.7</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-js-of-ocaml-5-7/14191/3">https://discuss.ocaml.org/t/ann-js-of-ocaml-5-7/14191/3</a>
</p>
</div>
<div id="outline-container-org1cb4164" class="outline-3">
<h3 id="org1cb4164">Hhugo announced</h3>
<div class="outline-text-3" id="text-org1cb4164">
<p>
Js_of_ocaml 5.7.2 was released recently. It adds missing primitives required by OCaml 5.2.0~beta
</p>
</div>
</div>
</div>
<div id="outline-container-10" class="outline-2">
<h2 id="10">Eio Developer Meetings</h2>
<div class="outline-text-2" id="text-10">
<p>
Archive: <a href="https://discuss.ocaml.org/t/eio-developer-meetings/12207/5">https://discuss.ocaml.org/t/eio-developer-meetings/12207/5</a>
</p>
</div>
<div id="outline-container-org2dacb4e" class="outline-3">
<h3 id="org2dacb4e">Sudha Parimala announced</h3>
<div class="outline-text-3" id="text-org2dacb4e">
<p>
Following the release of Eio 1.0 (<a href="https://discuss.ocaml.org/t/ann-eio-1-0-first-major-release/14334">https://discuss.ocaml.org/t/ann-eio-1-0-first-major-release/14334</a>), Eio goes into maintenance mode
for a bit. We've decided to pause the Eio developer meetings until further notice. Meanwhile, we remain active on the <a href="https://github.com/ocaml-multicore/eio/issues">issue
tracker</a> and the <a href="https://matrix.to/#/%23eio:roscidus.com">matrix channel</a>. I encourage
folks to try out Eio and report their findings.
</p>
</div>
</div>
</div>
<div id="outline-container-11" class="outline-2">
<h2 id="11">Ocaml developer at Routine, Paris</h2>
<div class="outline-text-2" id="text-11">
<p>
Archive: <a href="https://discuss.ocaml.org/t/job-ocaml-developer-at-routine-paris/14448/1">https://discuss.ocaml.org/t/job-ocaml-developer-at-routine-paris/14448/1</a>
</p>
</div>
