2024.04.09.org
** mefyl announced


Routine ([[https://routine.co][https://routine.co ]]) is once more looking for OCaml developers.

Routine is a personal productivity assistant and knowledge manager. The technological stack revolves heavily around OCaml which
represents 80% of the codebase, both client and server side. The remaining 20% are the UIs in various frontend framework:
- Browser and desktop (Linux/Macos/Windows) through electron, using Js_of_ocaml (eyeing on WASM).
- iOS via Swift bindings.
- Android via JVM bindings (upcoming).

Our technological and academic background leads us to use designs that, I think, can pique the interest of seasoned Ocaml developer.
Amongst other things :

- Type-driven programming based on ppx derivers that produces typescript declaration for frontend bindings, JSON schema to expose and consume external REST APIs (Google, Notion, …), automatic SQL bindings, etc.
- Automatic API and foreign binding generation for the different front end technology, cross compilation.
- [[https://github.com/janestreet/incremental][Incremental ]] based state updates to refresh minimal subsets of the app.
- Integrated graph query language to query and manipulate all the app data, including defining custom data types and workflows.
- Highly concurrent implementation through Lwt and Eio - migrating to the later as we go. Exception-free design. OCaml 5 with all the goodies.
- Angstrom based parsing for the interactive console with highlighting and completion.
- Everything is very much library-oriented, with loads of reusable and scaffolded packages. Most of the work is intended to be open sources, or already has been published.
- An obsession for compile-time checks and type safety.

We use state of the art CI/CD and development processes. Salary is up to market standard depending on the profile, plus usual options
package, to be discussed. We have a preference for presential work in our Paris 11th office (Charonne, 3 days a week) to help foster
team spirit but we won't pass on talented remote individuals.

We're looking to extend the team with talented and passionate engineers who see the global picture and will work through all layers
of the project to see it succeed and create something we're proud of. While we expect great OCaml and general computer science
proficiency, we’re open to most levels of experience. Thoroughness and a love for well rounded, robust and beautiful software design
is a must have - but that comes bundled with OCaml love, right ?

Do not hesitate to reach out for any question here, at [quentin.hocquet@routine.co](mailto:quentin.hocquet@routine.co) or refer this
to someone who may be interested.

Thanks for your time and happy hacking !
      



* dream-html 3.0.0
:PROPERTIES:
:CUSTOM_ID: 12
:END:
Archive: https://discuss.ocaml.org/t/ann-dream-html-3-0-0/14013/7

** Yawar Amin announced


[ANN] dream-html 3.3.1

Add ~to_xml~ and ~pp_xml~ functions to render in XML style

Normally, dream-html defaults to rendering nodes in HTML style, meaning that void elements are rendered just like opening tags. Eg
~<br>~. With the new ~to_xml~ and ~pp_xml~ functions, we can now render nodes in XML style, meaning ~<br />~. This allows XML parsers
to successfully parse the output. So eg you can use dream-html to author an ePub book.

Escape URI attributes like ~href~ with normal attribute escaping rules in addition to percent-encoding. Most significantly,
ampersands are encoded now, eg ~/foo?a=1&b=2~ is rendered as ~/foo?a=1&amp;b=2~.

Change where line breaks are inserted into the output markup, so that there is no chance of injecting spurious whitespace into the
rendered page. This gives complete control over whitespace to the user.
      



* Other OCaml News
:PROPERTIES:
:CUSTOM_ID: 13
:END:
** From the ocaml.org blog


Here are links from many OCaml blogs aggregated at [[https://ocaml.org/blog/][the ocaml.org blog]].

- [[https://tarides.com/blog/2024-04-03-updates-to-ocaml-org-s-learn-section-enhancing-ui-and-ux][Updates to OCaml.org's Learn Section: Enhancing UI and UX]]
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe to the [[https://sympa.inria.fr/sympa/info/caml-list][caml-list]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
