2024.04.09.html
<div id="outline-container-org6b9d25d" class="outline-3">
<h3 id="org6b9d25d">mefyl announced</h3>
<div class="outline-text-3" id="text-org6b9d25d">
<p>
Routine (<a href="https://routine.co">https://routine.co </a>) is once more looking for OCaml developers.
</p>

<p>
Routine is a personal productivity assistant and knowledge manager. The technological stack revolves heavily around OCaml which
represents 80% of the codebase, both client and server side. The remaining 20% are the UIs in various frontend framework:
</p>
<ul class="org-ul">
<li>Browser and desktop (Linux/Macos/Windows) through electron, using Js_of_ocaml (eyeing on WASM).</li>
<li>iOS via Swift bindings.</li>
<li>Android via JVM bindings (upcoming).</li>
</ul>

<p>
Our technological and academic background leads us to use designs that, I think, can pique the interest of seasoned Ocaml developer.
Amongst other things :
</p>

<ul class="org-ul">
<li>Type-driven programming based on ppx derivers that produces typescript declaration for frontend bindings, JSON schema to expose and consume external REST APIs (Google, Notion, …), automatic SQL bindings, etc.</li>
<li>Automatic API and foreign binding generation for the different front end technology, cross compilation.</li>
<li><a href="https://github.com/janestreet/incremental">Incremental </a> based state updates to refresh minimal subsets of the app.</li>
<li>Integrated graph query language to query and manipulate all the app data, including defining custom data types and workflows.</li>
<li>Highly concurrent implementation through Lwt and Eio - migrating to the later as we go. Exception-free design. OCaml 5 with all the goodies.</li>
<li>Angstrom based parsing for the interactive console with highlighting and completion.</li>
<li>Everything is very much library-oriented, with loads of reusable and scaffolded packages. Most of the work is intended to be open sources, or already has been published.</li>
<li>An obsession for compile-time checks and type safety.</li>
</ul>

<p>
We use state of the art CI/CD and development processes. Salary is up to market standard depending on the profile, plus usual options
package, to be discussed. We have a preference for presential work in our Paris 11th office (Charonne, 3 days a week) to help foster
team spirit but we won't pass on talented remote individuals.
</p>

<p>
We're looking to extend the team with talented and passionate engineers who see the global picture and will work through all layers
of the project to see it succeed and create something we're proud of. While we expect great OCaml and general computer science
proficiency, we’re open to most levels of experience. Thoroughness and a love for well rounded, robust and beautiful software design
is a must have - but that comes bundled with OCaml love, right ?
</p>

<p>
Do not hesitate to reach out for any question here, at [quentin.hocquet@routine.co](<a href="mailto:quentin.hocquet@routine.co">mailto:quentin.hocquet@routine.co</a>) or refer this
to someone who may be interested.
</p>

<p>
Thanks for your time and happy hacking !
</p>
</div>
</div>
</div>
<div id="outline-container-12" class="outline-2">
<h2 id="12">dream-html 3.0.0</h2>
<div class="outline-text-2" id="text-12">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dream-html-3-0-0/14013/7">https://discuss.ocaml.org/t/ann-dream-html-3-0-0/14013/7</a>
</p>
</div>
<div id="outline-container-orgdc89418" class="outline-3">
<h3 id="orgdc89418">Yawar Amin announced</h3>
<div class="outline-text-3" id="text-orgdc89418">
<p>
[ANN] dream-html 3.3.1
</p>

<p>
Add <code>to_xml</code> and <code>pp_xml</code> functions to render in XML style
</p>

<p>
Normally, dream-html defaults to rendering nodes in HTML style, meaning that void elements are rendered just like opening tags. Eg
<code>&lt;br&gt;</code>. With the new <code>to_xml</code> and <code>pp_xml</code> functions, we can now render nodes in XML style, meaning <code>&lt;br /&gt;</code>. This allows XML parsers
to successfully parse the output. So eg you can use dream-html to author an ePub book.
</p>

<p>
Escape URI attributes like <code>href</code> with normal attribute escaping rules in addition to percent-encoding. Most significantly,
ampersands are encoded now, eg <code>/foo?a=1&amp;b=2</code> is rendered as <code>/foo?a=1&amp;amp;b=2</code>.
</p>

<p>
Change where line breaks are inserted into the output markup, so that there is no chance of injecting spurious whitespace into the
rendered page. This gives complete control over whitespace to the user.
</p>
</div>
</div>
</div>
<div id="outline-container-13" class="outline-2">
<h2 id="13">Other OCaml News</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org4bf8af9" class="outline-3">
<h3 id="org4bf8af9">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-org4bf8af9">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://tarides.com/blog/2024-04-03-updates-to-ocaml-org-s-learn-section-enhancing-ui-and-ux">Updates to OCaml.org's Learn Section: Enhancing UI and UX</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org427b2f2" class="outline-2">
<h2 id="org427b2f2">Old CWN</h2>
<div class="outline-text-2" id="text-org427b2f2">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="org412bd96">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
